#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcp_resource.data.google_client_config.provider: Reading...
module.gcp_resource.data.google_container_cluster.my_cluster: Reading...
module.gcp_resource.data.google_client_config.provider: Read complete after 0s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.gcp_resource.data.google_container_cluster.my_cluster: Read complete after 6s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.gcp_resource.kubernetes_namespace.env: Refreshing state... [id=namespace-development]
module.gcp_resource.kubernetes_service.my_service: Refreshing state... [id=namespace-development/my-service]
module.gcp_resource.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa: Refreshing state... [id=namespace-development/java-rest-app-hpa-kfqf]
module.gcp_resource.kubernetes_deployment.deployment: Refreshing state... [id=namespace-development/java-rest-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gcp_resource.google_container_cluster.my_cluster will be created
  + resource "google_container_cluster" "my_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = false
      + enable_autopilot            = true
      + enable_intranode_visibility = true
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "northamerica-northeast1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "java-rest-app"
      + network                     = "default"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + gateway_api_config (known after apply)

      + ip_allocation_policy (known after apply)

      + logging_config (known after apply)

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config (known after apply)
    }

  # module.gcp_resource.kubernetes_deployment.deployment will be destroyed
  # (because kubernetes_deployment.deployment is not in configuration)
  - resource "kubernetes_deployment" "deployment" {
      - id               = "namespace-development/java-rest-app" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 2 -> null
          - labels           = {
              - "app" = "java-rest-app"
            } -> null
          - name             = "java-rest-app" -> null
          - namespace        = "namespace-development" -> null
          - resource_version = "83695" -> null
          - uid              = "9a6b834c-5d6f-4993-b223-502ecde3fb9a" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "3" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "java-rest-app"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations      = {} -> null
                  - generation       = 0 -> null
                  - labels           = {
                      - "app" = "java-rest-app"
                    } -> null
                    name             = null
                    # (4 unchanged attributes hidden)
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null
                    # (6 unchanged attributes hidden)

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:latest" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "spring-boot-rest-app-1" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null
                        # (1 unchanged attribute hidden)

                      - resources {
                          - limits   = {
                              - "ephemeral-storage" = "1Gi"
                            } -> null
                          - requests = {
                              - "cpu"               = "500m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "2Gi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  - security_context {
                      - run_as_non_root        = false -> null
                      - supplemental_groups    = [] -> null
                        # (4 unchanged attributes hidden)

                      - seccomp_profile {
                          - type              = "RuntimeDefault" -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - toleration {
                      - effect             = "NoSchedule" -> null
                      - key                = "kubernetes.io/arch" -> null
                      - operator           = "Equal" -> null
                      - value              = "amd64" -> null
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        }
    }

  # module.gcp_resource.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa will be destroyed
  # (because kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa is not in configuration)
  - resource "kubernetes_horizontal_pod_autoscaler_v2" "java_rest_app_hpa" {
      - id = "namespace-development/java-rest-app-hpa-kfqf" -> null

      - metadata {
          - generation       = 0 -> null
          - labels           = {
              - "app" = "java-rest-app"
            } -> null
          - name             = "java-rest-app-hpa-kfqf" -> null
          - namespace        = "namespace-development" -> null
          - resource_version = "83702" -> null
          - uid              = "48435e64-73e1-420f-ae19-307ff7dc24e4" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - max_replicas                      = 3 -> null
          - min_replicas                      = 1 -> null
          - target_cpu_utilization_percentage = 0 -> null

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }

          - metric {
              - type = "Resource" -> null

              - resource {
                  - name = "cpu" -> null

                  - target {
                      - average_utilization = 80 -> null
                      - type                = "Utilization" -> null
                        # (2 unchanged attributes hidden)
                    }
                }
            }

          - scale_target_ref {
              - api_version = "apps/v1" -> null
              - kind        = "Deployment" -> null
              - name        = "java-rest-app" -> null
            }
        }
    }

  # module.gcp_resource.kubernetes_namespace.env will be destroyed
  # (because kubernetes_namespace.env is not in configuration)
  - resource "kubernetes_namespace" "env" {
      - id                               = "namespace-development" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "namespace-development" -> null
          - resource_version = "65696" -> null
          - uid              = "3a72049d-23b0-445a-9ed8-285b58f246dd" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.gcp_resource.kubernetes_service.my_service will be destroyed
  # (because kubernetes_service.my_service is not in configuration)
  - resource "kubernetes_service" "my_service" {
      - id                     = "namespace-development/my-service" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - ip       = "34.152.41.195"
                                # (1 unchanged attribute hidden)
                            },
                        ]
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                )
            } -> null
          - generation       = 0 -> null
          - name             = "my-service" -> null
          - namespace        = "namespace-development" -> null
          - resource_version = "84295" -> null
          - uid              = "c8c9eb23-4913-483e-98b7-cb0fccaef007" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ip                        = "34.118.226.178" -> null
          - cluster_ips                       = [
              - "34.118.226.178",
            ] -> null
          - external_traffic_policy           = "Cluster" -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [
              - "IPv4",
            ] -> null
          - ip_family_policy                  = "SingleStack" -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {
              - "app" = "java-rest-app"
            } -> null
          - session_affinity                  = "None" -> null
          - type                              = "LoadBalancer" -> null
            # (3 unchanged attributes hidden)

          - port {
                name         = null
              - node_port    = 32015 -> null
              - port         = 80 -> null
              - protocol     = "TCP" -> null
              - target_port  = "8080" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 1 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*